#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_client_config.current: Reading...
azurerm_container_registry.this: Refreshing state... [id=/subscriptions/c5d2655e-c8c3-4594-ac69-a626ab50d281/resourceGroups/mshackathonoct2022/providers/Microsoft.ContainerRegistry/registries/mshackathonoct2022mlcr]
azurerm_application_insights.this: Refreshing state... [id=/subscriptions/c5d2655e-c8c3-4594-ac69-a626ab50d281/resourceGroups/mshackathonoct2022/providers/Microsoft.Insights/components/mshackathonoct2022mlw-ai]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00ZDdlYzcxZi02MmE2LTQ3YjQtYjBkOS1jZjJhZTVmZTkwMzY7b2JqZWN0SWQ9YTFmYzUzOWEtMjI4Yi00ZTMxLWJkY2QtZTVmNDE1ZDNmYzMzO3N1YnNjcmlwdGlvbklkPWM1ZDI2NTVlLWM4YzMtNDU5NC1hYzY5LWE2MjZhYjUwZDI4MTt0ZW5hbnRJZD1mODhjNzZlMS0yZTc5LTRjZDUtOGIzNy04NDJmM2Y4NzBkNTg=]
azurerm_storage_account.this: Refreshing state... [id=/subscriptions/c5d2655e-c8c3-4594-ac69-a626ab50d281/resourceGroups/mshackathonoct2022/providers/Microsoft.Storage/storageAccounts/mshackathonoct2022mlwst]
azurerm_key_vault.this: Refreshing state... [id=/subscriptions/c5d2655e-c8c3-4594-ac69-a626ab50d281/resourceGroups/mshackathonoct2022/providers/Microsoft.KeyVault/vaults/mshackathonoct2022mlw-kv]
azurerm_machine_learning_workspace.this: Refreshing state... [id=/subscriptions/c5d2655e-c8c3-4594-ac69-a626ab50d281/resourceGroups/mshackathonoct2022/providers/Microsoft.MachineLearningServices/workspaces/mshackathonoct2022mlw]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "mshackathonoct2022-be"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "mshackathonoct2022"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_image        = (known after apply)
              + docker_image_tag    = (known after apply)
              + dotnet_version      = (known after apply)
              + java_server         = (known after apply)
              + java_server_version = (known after apply)
              + java_version        = (known after apply)
              + node_version        = (known after apply)
              + php_version         = (known after apply)
              + python_version      = (known after apply)
              + ruby_version        = (known after apply)
            }
        }
    }

  # azurerm_service_plan.this will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "mshackathonoct2022-asp"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "mshackathonoct2022"
      + sku_name                     = "B1"
      + worker_count                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/mshackathonoct2022/mshackathonoct2022/prod-uks.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/mshackathonoct2022/mshackathonoct2022/prod-uks.tfplan"

```

</details>

*Pushed by: @johnmckenna, Action: `pull_request`*